// Copyright (C) 2020-2021 Sami Väisänen
// Copyright (C) 2020-2021 Ensisoft http://www.ensisoft.com
//
// This program is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// This program is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with this program.  If not, see <https://www.gnu.org/licenses/>.

#pragma once

#include "config.h"

#include "warnpush.h"

#include "warnpop.h"

#include <vector>
#include <string>
#include <memory>
#include <variant>
#include <tuple>
#include <unordered_map>
#include <limits>
#include <cstdint>

#include "base/assert.h"
#include "base/utility.h"
#include "base/bitflag.h"
#include "data/fwd.h"
#include "game/enum.h"
#include "game/types.h"

namespace game
{
    class TilemapData;
    class Loader;

    namespace detail {
        enum class TilemapLayerType {
            Render,
            Render_DataSInt4,
            Render_DataUInt4,
            Render_DataSInt8,
            Render_DataUInt8,
            Render_DataUInt24,
            Render_DataSInt24,
            DataSInt8,
            DataUInt8,
            DataSInt16,
            DataUInt16
        };

        template<typename IntType>
        struct RenderDataTile {
            uint8_t index = 0;
            IntType data  = 0;
        };
        template<typename IntType> inline
        bool operator==(const RenderDataTile<IntType>& lhs,
                        const RenderDataTile<IntType>& rhs)
        {
            return lhs.index == rhs.index && lhs.data  == rhs.data;
        }

        template<typename IntType>
        struct RenderDataTile_Packed_8_24 {
            uint32_t index : 8;
            IntType data  : 24;
        };
        template<typename IntType> inline
        bool operator==(const RenderDataTile_Packed_8_24<IntType>& lhs,
                        const RenderDataTile_Packed_8_24<IntType>& rhs)
        { return lhs.index == rhs.index && lhs.data == rhs.data; }

        template<typename IntType>
        struct RenderDataTile_Packed_4_4 {
            uint8_t index: 4;
            IntType data:  4;
        };
        template<typename IntType> inline
        bool operator==(const RenderDataTile_Packed_4_4<IntType>& lhs,
                        const RenderDataTile_Packed_4_4<IntType>& rhs)
        { return lhs.index == rhs.index && lhs.data == rhs.data; }

        template<typename T>
        struct DataTile {
            T data;
        };
        template<typename T> inline
        bool operator==(const DataTile<T>& lhs, const DataTile<T>& rhs)
        { return lhs.data == rhs.data; }

        struct Render_Tile {
            uint8_t index = 0;
        };
        inline bool operator==(const Render_Tile& lhs, const Render_Tile& rhs)
        { return lhs.index == rhs.index; }

        using Render_Data_Tile_UInt4  = RenderDataTile_Packed_4_4<uint8_t>;
        using Render_Data_Tile_SInt4  = RenderDataTile_Packed_4_4<int8_t>;
        using Render_Data_Tile_UInt24 = RenderDataTile_Packed_8_24<uint32_t>;
        using Render_Data_Tile_SInt24 = RenderDataTile_Packed_8_24<int32_t>;
        using Render_Data_Tile_UInt8  = RenderDataTile<uint8_t>;
        using Render_Data_Tile_SInt8  = RenderDataTile<int8_t>;

        using Data_Tile_SInt8   = DataTile<int8_t>;
        using Data_Tile_UInt8   = DataTile<uint8_t>;
        using Data_Tile_SInt16  = DataTile<int16_t>;
        using Data_Tile_UInt16  = DataTile<uint16_t>;

        static_assert(sizeof(Render_Data_Tile_UInt4) == 1);
        static_assert(sizeof(Render_Data_Tile_UInt8) == 2);
        static_assert(sizeof(Render_Data_Tile_SInt8) == 2);
        static_assert(sizeof(Render_Data_Tile_UInt24) == 4);
        static_assert(sizeof(Data_Tile_SInt8) == 1);
        static_assert(sizeof(Data_Tile_UInt8) == 1);
        static_assert(sizeof(Data_Tile_SInt16) == 2);
        static_assert(sizeof(Data_Tile_UInt16) == 2);

        template<typename T>
        struct TilemapLayerTraits;

        template<>
        struct TilemapLayerTraits<Render_Tile> {
            static constexpr auto LayerType = TilemapLayerType::Render;
            static constexpr auto MaxPaletteIndex = 0xff;
        };
        template<>
        struct TilemapLayerTraits<Render_Data_Tile_UInt4> {
            static constexpr auto LayerType = TilemapLayerType::Render_DataUInt4;
            static constexpr auto MaxPaletteIndex = 0xf;
            static constexpr auto MaxValue = 0xf;
            static constexpr auto MinValue = 0x0;
        };
        template<>
        struct TilemapLayerTraits<Render_Data_Tile_SInt4> {
            static constexpr auto LayerType = TilemapLayerType::Render_DataUInt4;
            static constexpr auto MaxPaletteIndex = 0xf;
            static constexpr int32_t MaxValue =  0x7;
            static constexpr int32_t MinValue = -0x8;
        };
        template<>
